app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "title"], ["room_number", 5]]
---
    def create
        binding.pry
        @school_class = SchoolClass.create(title: params[:school_class][:title], room_number: params[:school_class][:room_number])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @school_class = SchoolClass.find_by(id: params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @school_class = SchoolClass.find_by(id: params[:id])