app/controllers/students_controller.rb

    def create
        # binding.pry
        ##the following doesn't work because it needs to require these fields be filled in
        # @student = Student.create(first_name: params[:first_name], last_name: params[:last_name])
        @student = Student.create(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-03-11 04:23:22.144104"], ["updated_at", "2021-03-11 04:23:22.144104"]]